glcloud/keil_v5/ARM/PACK/.Web/Keil.LPC4000_DFP.pdsc
    <component Cclass="CMSIS Driver" Cgroup="USB Host" Capiversion="2.1" Cversion="1.0" condition="LPC40xx CMSIS_Driver USB">
      <description>USB OHCI Host Driver for LPC4000 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBH0               /* Driver USBH0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/USBH_LPC40xx.c"/>
        <file category="source" name="RTE_Driver/OTG_LPC40xx.c"/>
      </files>
    </component>

    <!-- LPC4088-32 Developers Kit -->
    <bundle Cbundle="LPC4088-32 Developers Kit" Cclass="Board Support" Cversion="1.0.0">
      <description>Embedded Artists LPC4088-32 Developers Kit</description>
      <doc></doc>
      <component Cgroup="A/D Converter" Capiversion="1.00" condition="LPC40xx EA_BSP ADC">
        <description>A/D Converter interface for Embedded Artists LPC4088-32 Developers Kit</description>
        <files>
          <file category="source" name="Boards/Embedded Artists/LPC4088-32 Developers Kit/Common/ADC_EA_LPC4088.c"/>
        </files>
      </component>
      <component Cgroup="Audio" Capiversion="1.01" condition="LPC40xx EA_BSP Audio">
        <description>Audio interface for UDA1380</description>
        <files>
          <file category="source" name="Boards/Embedded Artists/LPC4088-32 Developers Kit/Common/Audio_UDA1380.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.00" condition="LPC40xx EA_BSP Button LED">
        <description>Buttons interface for Embedded Artists LPC4088-32 Developers Kit</description>
        <files>
          <file category="source" name="Boards/Embedded Artists/LPC4088-32 Developers Kit/Common/Buttons_EA_LPC4088.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" Capiversion="1.00" Cvariant="TFT 800x480" condition="LPC40xx EA_BSP GLCD BIG">
        <description>LCD Board rev PB1 "7 inch TFT 800x480" for Embedded Artists LPC1788-32 Developers Kit</description>
        <RTE_Components_h>
          <!-- the following content goes into file 'RTE_Components.h' -->
          #define RTE_EA_LCD_TFT_800x480
        </RTE_Components_h>
        <files>
          <file category="header" name="Boards/Embedded Artists/LPC4088-32 Developers Kit/Common/GLCD_Config.h"/>
          <file category="source" name="Boards/Embedded Artists/LPC4088-32 Developers Kit/Common/GLCD_Fonts.c"/>
          <file category="source" name="Boards/Embedded Artists/LPC4088-32 Developers Kit/Common/GLCD_EA_LPC4088.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" Capiversion="1.00" Cvariant="TFT 480x272" condition="LPC40xx EA_BSP GLCD BIG">
        <description>LCD Board rev PB1 "4.3 inch TFT 480x272" for Embedded Artists LPC4088-32 Developers Kit</description>
        <RTE_Components_h>
          <!-- the following content goes into file 'RTE_Components.h' -->
          #define RTE_EA_LCD_TFT_480x272
        </RTE_Components_h>
        <files>
          <file category="header" name="Boards/Embedded Artists/LPC4088-32 Developers Kit/Common/GLCD_Config.h"/>
          <file category="source" name="Boards/Embedded Artists/LPC4088-32 Developers Kit/Common/GLCD_Fonts.c"/>
          <file category="source" name="Boards/Embedded Artists/LPC4088-32 Developers Kit/Common/GLCD_EA_LPC4088.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" Capiversion="1.00" Cvariant="TFT 320x240" condition="LPC40xx EA_BSP GLCD LITTLE">
        <description>LCD Board rev PB1 "3.2 inch TFT 320x240" for Embedded Artists LPC1788-32 Developers Kit</description>
        <RTE_Components_h>
          <!-- the following content goes into file 'RTE_Components.h' -->
          #define RTE_EA_LCD_TFT_320x240
        </RTE_Components_h>
        <files>
          <file category="header" name="Boards/Embedded Artists/LPC4088-32 Developers Kit/Common/GLCD_Config.h"/>
          <file category="source" name="Boards/Embedded Artists/LPC4088-32 Developers Kit/Common/GLCD_Fonts.c"/>
          <file category="source" name="Boards/Embedded Artists/LPC4088-32 Developers Kit/Common/GLCD_EA_LPC4088.c"/>
        </files>
      </component>
      <component Cgroup="Joystick" Capiversion="1.00" condition="LPC40xx EA_BSP Joystick">
        <description>Joystick interface for Embedded Artists LPC4088-32 Developers Kit</description>
        <files>
          <file category="source" name="Boards/Embedded Artists/LPC4088-32 Developers Kit/Common/Joystick_EA_LPC4088.c"/>
        </files>
      </component>
      <component Cgroup="LED" Capiversion="1.00" condition="LPC40xx EA_BSP Button LED">
      <description>LED driver for Embedded Artists LPC4088-32 Developers Kit</description>
        <files>
        <file category="source" name="Boards/Embedded Artists/LPC4088-32 Developers Kit/Common/LED_EA_LPC4088.c"/>
        </files>
      </component>
    </bundle>
  </components>

  <examples>
    <!-- LPC4088-32 Developers Kit -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/Embedded Artists/LPC4088-32 Developers Kit/Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="LPC4088-32 Developers Kit" vendor="Embedded Artists"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- Middleware::CAN examples -->
    <example name="CAN" doc="Abstract.txt" folder="Boards/Embedded Artists/LPC4088-32 Developers Kit/Middleware/CAN/CAN" version="1.0.0">
      <description>CAN example that sends and receives data messages</description>
      <board name="LPC4088-32 Developers Kit" vendor="Embedded Artists"/>
      <project>
        <environment name="uv" load="CAN.uvprojx"/>
      </project>
      <attributes>
        <category>Middleware</category>
        <category>CAN</category>
      </attributes>
    </example>

    <!-- Middleware::FileSystem examples -->

    <example name="File System Demo" doc="Abstract.txt" folder="Boards/Embedded Artists/LPC4088-32 Developers Kit/Middleware/FileSystem/File_Demo" version="1.0.0">
      <description>File manipulation example: create, read, copy, delete files on any enabled drive (SD/MMC Card) and format each drive</description>
      <board name="LPC4088-32 Developers Kit" vendor="Embedded Artists"/>
      <project>
        <environment name="uv" load="File_Demo.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="File System" Cgroup="Drive"/>
        <category>Middleware</category>
        <category>File System</category>
        <keyword>SD/MMC Card</keyword>
      </attributes>
    </example>

    <!-- Middleware::NetworkDS examples -->

